In [1]:
import seaborn as sns
import pandas as pd

titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
# (1) 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [3]:
# (2) value_counts() 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 
# 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.
print(titanic.value_counts('sex'))
print(titanic.value_counts('age'))
print(titanic.value_counts('class'))
print(titanic.value_counts('alive'))

sex
male      577
female    314
dtype: int64
age
24.00    30
22.00    27
18.00    26
30.00    25
28.00    25
         ..
20.50     1
14.50     1
12.00     1
0.92      1
80.00     1
Length: 88, dtype: int64
class
Third     491
First     216
Second    184
dtype: int64
alive
no     549
yes    342
dtype: int64

In [ ]:
#또다른 풀이
titanic['sex'].value_counts()
titanic['age'].value_counts()
titanic['class'].value_counts()
titanic['survived'].value_counts()
##
titanic[['sex', 'age', 'class', 'survived']].count()

In [4]:
# (3) 타이타닉호 승객의 평균 나이를 구하라.
titanic['age'].mean()

29.69911764705882

In [5]:
# (4) 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
titanic[titanic['sex'] == 'female'].age.mean()

27.915708812260537

In [ ]:
#또다른 풀이
titanic[titanic.sex == "female"]["age"].mean()
##
titanic.loc[titanic.sex == 'female']['age'].mean()

In [6]:
# (5) 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
titanic.loc[(titanic['sex'] == 'female')&(titanic['pclass'] == 1)].age.mean()

34.61176470588235

In [ ]:
#또다른 풀이
titanic[titanic['class'] =='First' ][ titanic['sex']=='female'].age.mean()
##
titanic[titanic.pclass == 1][ titanic['sex']=='female']["age"].mean()

In [7]:
#(6) 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라.
#20살이 넘으면 성별을 그대로 사용한다.
#20살 미만이면 성별에 관계없이 “child”라고 한다.
titanic['category1'] = titanic.apply(lambda x : x.age if x.age >= 20 else 'child', axis=1)
print(titanic.tail(5))

     survived  pclass     sex   age  sibsp  parch   fare embarked   class  \
886         0       2    male  27.0      0      0  13.00        S  Second
887         1       1  female  19.0      0      0  30.00        S   First
888         0       3  female   NaN      1      2  23.45        S   Third
889         1       1    male  26.0      0      0  30.00        C   First
890         0       3    male  32.0      0      0   7.75        Q   Third

       who  adult_male deck  embark_town alive  alone category1
886    man        True  NaN  Southampton    no   True      27.0
887  woman       False    B  Southampton   yes   True     child
888  woman       False  NaN  Southampton    no  False     child
889    man        True    C    Cherbourg   yes   True      26.0
890    man        True  NaN   Queenstown    no   True      32.0